Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: It can be drawn with canvas.drawPath(path, paint), either filled or stroked (based on the paint's Style), or it can be used for clipping or to draw text on a path.
zh_cn: 它可以使用 canvas.drawPath(path, paint) 绘制，填充或描边(基于 paint 的样式)，或者它可以用于裁剪或在路径上绘制文本。

source: It can be tempting to write code that completely ignores an exception, such as:
zh_cn: 开发者可能会倾向于编写完全忽略异常的代码，例如：

source: It encapsulates a specific set of functionality with an easy to use interface, it uses CPU and memory efficiently, and so forth.
zh_cn: 它通过易于使用的接口封装了一组特定的函数，它有效地使用 CPU 和内存，等等。

source: It even raises warnings if the region you've defined for the stretchable area is at risk of producing drawing artifacts as a result of the pixel replication.
zh_cn: 如果你为可伸缩区域定义的区域有可能由于像素复制而产生绘图伪影的风险，那么它甚至会引发警告。

source: It excludes these resources because loading them is an inline process, and does not block the app’s initial display.
zh_cn: 它排除了这些资源，因为加载它们是一个内联过程，并不会阻止应用程序的初始显示。

source: It extends EditText, which is the View we have chosen to customize in this case.
zh_cn: 它继承于我们所选择进行自定义的 EditText。

source: It handles rendering of keys and detecting key presses and touch movements.
zh_cn: 它处理按键的渲染并检测按键和触摸动作。

source: It indicates that any reflection of the data at position is out of date and should be updated.
zh_cn: 它表示 position 处的数据的任何反射都已过期，应该更新。

source: It indicates that any reflection of the data in the given position range is out of date and should be updated.
zh_cn: 它表示数据在给定位置范围内的任何反射都已过期，应进行更新。

source: It is static, meaning it does not generate the so-called "synthetic methods" that allow it to access data from the parent class, which in turn means that it really behaves as a separate class rather than something strongly related to NoteEditor.
zh_cn: 它是 static 方法，意味首它不会生成可以访问父类数据的所谓的 "synthetic methods（不知道怎么翻译，改天翻书去）"，相反的意味着它确实表现为一个独立的类而不会强烈依赖 NoteEditor。

source: It is an implementation of material design bottom navigation.
zh_cn: 它是 material design bottom navigation 的实现。

source: It is called only for the reference item and rest of the items are assigned to spans based on the reference item.
zh_cn: 它只为参考的 item 调用该方法，其他的 item 基于参考 item 分配 span。

source: It is defined as an inner class within the NoteEditor activity, but it is public so that it could be accessed as NoteEditor.MyEditText from outside of the NoteEditor class if desired.
zh_cn: 它被定义为 NoteEditor activity 的内部类，但它是 public 的，所以如果需要，也可以在外部通过 NoteEditor.MyEditText 来访问。

source: It is designed to be used as a direct child of a AppBarLayout.
zh_cn: 它被设计为用作 AppBarLayout 的直接子项。

source: It is developers responsibility to decide whether they want to keep their Views in this custom cache or let the default recycling policy handle it.
zh_cn: 开发人员有责任决定是将 view 保存在这个自定义缓存中，还是让默认的回收策略处理它。

source: It is generally slower than a traditional HashMap, since lookups require a binary search and adds and removes require inserting and deleting entries in the array.
zh_cn: 它通常比传统的 HashMap 慢，因为查找需要二分搜索，添加和移除需要在数组中插入和移除条目。

source: It is generally slower than a traditional HashSet, since lookups require a binary search and adds and removes require inserting and deleting entries in the array.
zh_cn: 它通常比传统的 HashSet 慢，因为查找需要二分搜索，添加和移除需要在数组中插入和移除条目。

source: It is guaranteed, however, that the thread that invokes finalize will not be holding any user-visible synchronization locks when finalize is invoked.
zh_cn: 但是，保证调用 finalize 的线程在调用 finalize 时不会保留任何用户可见的同步锁。

source: It is important to know that a SurfaceTexture is available only after the TextureView is attached to a window (and onAttachedToWindow() has been invoked.) It is therefore highly recommended you use a listener to be notified when the SurfaceTexture becomes available.
zh_cn: 重要的是要知道只有在 TextureView 附加到窗口后才能使用 SurfaceTexture(并且已调用 onAttachedToWindow()。)因此强烈建议你使用当 SurfaceTexture 可用时通知的监听器。

source: It is important to note that only one producer can use the TextureView.
zh_cn: 重要的是要注意，只有一个生产者可以使用 TextureView。

source: It is important to remember that a column can be both shrinkable and stretchable.
zh_cn: 必须记住，列既可以收缩，也可以拉伸。

source: It is intended to be more memory efficient than using a HashMap to map Integers to Objects, both because it avoids auto-boxing keys and its data structure doesn't rely on an extra entry object for each mapping.
zh_cn: 它的目的是比使用 HashMap 将整数映射到对象更有效，这是因为它避免了自动装箱键，并且它的数据结构不依赖于每个映射的额外条目对象。

source: It is intended to be used as a child view of a ViewPager widget in your XML layout.
zh_cn: 它旨在用作 XML 布局中 ViewPager 小部件的子 view。

source: It is not included in this count.
zh_cn: 它不包括在此计数中。

source: It is only relevant for width.
zh_cn: 它仅与宽度有关。

source: It is possible to determine whether the system is currently in 24-hour mode by calling is24HourModeEnabled().
zh_cn: 通过调用 is24HourModeEnabled()，可以确定系统当前是否处于 24 小时模式。

source: It is possible to iterate over the items in this container using keyAt(int) and valueAt(int).
zh_cn: 可以使用 keyAt(int) 和 valueAt(int) 遍历此容器中的项。

source: It is possible to retrieve the location of a view by invoking the methods getLeft() and getTop().
zh_cn: 可以通过调用方法 getLeft() 和 getTop() 来获取 view 的位置。

source: It is recommend you use this unit when specifying font sizes, so they will be adjusted for both the screen density and the user's preference.
zh_cn: 建议你在指定字体大小时使用此单位，以便根据屏幕密度和用户偏好调整它们。

source: It is recommended to use ARGB_8888 instead of this configuration.
zh_cn: 建议使用 ARGB_8888 来代替此配置。

source: It is recommended to use the materialButtonOutlinedStyle attribute for all child buttons.
zh_cn: 建议对所有子按钮使用 materialButtonOutlinedStyle 属性。

source: It is recommended you base your own implementation on the source code for the Android Open Source Project if you must use it in your application.
zh_cn: 如果你必须在应用程序中使用它，建议你将自己的实现基于 Android 开源项目的源代码。

source: It is recommended you use TextClock instead.
zh_cn: 建议你改用 TextClock。

source: It is the fully qualified name of the custom view class.
zh_cn: 它是自定义 view 类的完全限定名称。

source: It is very dangerous because it means that Exceptions you never expected (including RuntimeExceptions like ClassCastException) get caught in application-level error handling.
zh_cn: 这样做非常危险，因为这意味着系统会在处理应用级错误期间捕获到你从未预料到的异常(包括 ClassCastException 之类的 RuntimeException)。

source: It keeps its mappings in an array data structure -- an integer array of hash codes for each item, and an Object array of the key/value pairs.
zh_cn: 它将映射保存在一个数组数据结构中 -- 每个项的是一个散列码的整数数组，以及键/值对的一个对象数组。

source: It lets you create and save constraints, and apply them to an existing ConstraintLayout.
zh_cn: 它允许你创建并保存约束，并将其应用到现有的 ConstraintLayout。

source: It makes a best effort to constrain the views to their current positions while allowing flexibility.
zh_cn: 它尽最大努力将 view 限制在当前位置，同时允许灵活性。

source: It may not be the child view with this LayoutParams or a descendant of it.
zh_cn: 它可能不是具有此 LayoutParams 或其后代的子 view。

source: It may still return true even if the image has more than one channel and therefore will not be treated as an alpha mask.
zh_cn: 即使图像有多个通道，它仍然可以返回 true，因此不会被视为 alpha 蒙版。

source: It must be saved with the extension .9.png, and saved into the res/drawable/ directory of your project.
zh_cn: 它的扩展名必须保存为 .9.png，并且保存在项目中的 res/drawable/ 文件夹。

source: It obscures the failure handling properties of your code, meaning if someone adds a new type of Exception in the code you're calling, the compiler won't help you realize you need to handle the error differently.
zh_cn: 它掩盖了代码的故障处理属性，也就是说，如果有人在你所调用的代码中添加了一种新类型的异常，编译器不会帮助你意识到你需要采取不同的方式来处理该错误。

source: It offers an opportunity for the view and its superclasses to perform initial configuration for the nested scroll.
zh_cn: 它为 view 及其超类提供了对嵌套滚动执行初始配置的机会。

source: It provides convenient list diffing support out of the box, similar to ListAdapter and AsyncListDiffer.
zh_cn: 它提供了方便的列表差异支持，类似于 ListAdapter 和 AsyncListDiffer。

source: It provides several top level options as action buttons while spilling remaining options over as items in an overflow menu.
zh_cn: 它提供了几个顶级选项作为操作按钮，同时将剩余选项作为溢出菜单中的项目溢出。

source: It provides the PagedList class that operates as a self-loading list, provided a source of data like a database, or paginated network API.
zh_cn: 它提供 PagedList 类，作为自加载列表运行，提供数据源(如数据库或分页网络 API)。

source: It should be used whenever possible.
zh_cn: 应尽可能使用它。

source: It should try to stay within the specifications passed in, although it can choose to exceed them (in this case, the parent can choose what to do, including clipping, scrolling, throwing an exception, or asking the onMeasure() to try again, perhaps with different measurement specifications).
zh_cn: 它应该尽量留在传递的规格中，尽管它也可以选择超过它们(在这种情况下，父类会选择一项操作，包括修剪，滚动，抛出异常，让 onMeasure() 重试，也许使用不同的测量规格)。

source: It supports horizontal & vertical layout as well as an ability to layout children in reverse.
zh_cn: 它支持水平及垂直的布局，也支持子 view 的逆向。

source: It takes care of synchronizing the controls with the state of the MediaPlayer.
zh_cn: 它负责将控件与 MediaPlayer 的状态同步。

source: It then chooses the configuration that yields the smallest compressed output.
zh_cn: 然后，它选择产生最小压缩输出的配置。

source: It uses a mix of text, lines, and shapes.
zh_cn: 它使用文本，线条和形状的混合。

source: It will be ignored because Chip manages its own background Drawable.
zh_cn: 它将被忽略，因为 Chip 管理自己的背景 Drawable。

source: It will be stripped of any styled text information.
zh_cn: 它将被删除任何样式的文本信息。

source: It will only apply if the size of the widget is set to MATCH_CONSTRAINT.
zh_cn: 只有部件的大小设置为 MATCH_CONSTRAINT 时，它才适用。

source: It's a convenient way to easily hide/show a set of widgets without having to maintain this set programmatically.
zh_cn: 这是一种方便的方法，可以轻松隐藏/显示一组小部件，而无需以编程方式维护此设置。

source: It's common to divide the x and y velocity by a factor of 4 to 8.
zh_cn: 将 x 和 y 速度除以 4 到 8 倍是很常见的。

source: It's customary to put these resources into a res/values/attrs.xml file.
zh_cn: 习惯上将这些资源放入 res/values/attrs.xml 文件中。

source: It's easy to forget to expose properties and events, especially when you're the only user of the custom view.
zh_cn: 很容易忘记公开属性和事件，尤其是当你是自定义view的唯一用户时。

source: It's similar to RelativeLayout in that all views are laid out according to relationships between sibling views and the parent layout, but it's more flexible than RelativeLayout and easier to use with Android Studio's Layout Editor.
zh_cn: 它类似于 RelativeLayout 因为所有视图都是根据兄弟视图和父布局之间的关系来布局的，但它比 RelativeLayout 更灵活，并且更易于与 Android Studio 的布局编辑器一起使用。

source: It's used by calling setDragged(boolean).
zh_cn: 通过调用 setDragged(boolean) 来使用它。

source: It's your responsibility to get and apply new coordinates at a rate that will make the scrolling animation look smooth.
zh_cn: 你有责任按一定的速率来获取和应用新坐标，以使滚动动画看起来流畅。

source: It's your responsibility to make sure you get and apply new coordinates often enough to make the scrolling animation look smooth.
zh_cn: 你有责任确保经常获得并应用新坐标，以使滚动动画看起来流畅。

source: Item changes are when a single item has its data updated but no positional changes have occurred.
zh_cn: 项更改是指单个项的数据已更新但未发生位置更改的情况。

source: Item for this view was removed.
zh_cn: 已移除此 view 的项。

source: Item position
zh_cn: item 位置

source: Iterating over the keys using keyAt(int) with ascending values of the index will return the keys in ascending order, or the values corresponding to the keys in ascending order in the case of valueAt(int).
zh_cn: 使用带索引升序值的 keyAt(int) 对键进行迭代将按升序返回键，或者在 valueAt(int) 的情况下，按升序返回与键对应的值。

source: Iterators that do this are known as fail-fast iterators, as they fail quickly and cleanly, rather that risking arbitrary, non-deterministic behavior at an undetermined time in the future.
zh_cn: 执行该操作的迭代器称为 fail-fast 迭代器，因为迭代器很快就完全失败，而不会冒着在将来某个时间任意发生不确定行为的风险。

source: Java Language Rules
zh_cn: Java 语言规则

source: Java Library Rules
zh_cn: Java 库规则

source: Java Style Rules
zh_cn: Java 样式规则

source: Java is a registered trademark of Oracle and/or its affiliates.
zh_cn: Java 是 Oracle 和/或其附属公司的注册商标。

source: Javatests Style Rules
zh_cn: Javatests 样式规则

source: Just as with primitive shapes, paths can be outlined, filled, or both, depending on the setStyle().
zh_cn: 与基本形状一样，路径可以是轮廓，填充或两者，具体取决于 setStyle()。

source: Keep in mind that code that calls Log.v() is compiled and executed on release builds, including building the strings, even if the logs aren't being read.
zh_cn: 请注意，即使没有读取日志信息，调用 Log.v() 的代码也会在发布版本中进行编译和执行，包括编译字符串。

source: Keep in mind that same adapter may be observed by multiple RecyclerViews.
zh_cn: 请记住，多个 RecyclerViews 可能会观察到同一个适配器。

source: Keep in mind that the + operator, when used on Strings, implicitly creates a StringBuilder with the default buffer size (16 characters) and potentially other temporary String objects, i.e. that explicitly creating StringBuilders isn't more expensive than relying on the default '+' operator (and can be a lot more efficient in fact).
zh_cn: 请注意，在对 String 使用 + 运算符时，它会隐式创建一个具有默认缓冲区(大小为 16 个字符)的 StringBuilder ，还可能会创建其他临时 String 对象。例如，显式创建 StringBuilder 并不比依赖默认的 '+' 运算符成本更高(实际上可能更高效)。

source: Keep in mind that the aapt has the following limitations:
zh_cn: 请记住，aapt 具有以下限制：

source: Keep in mind that the View in question is already removed from the RecyclerView.
zh_cn: 请记住，所讨论的 View 已从 RecyclerView 中移除。

source: Keep the scope of local variables to a minimum.
zh_cn: 尽可能缩小局部变量的作用域。

source: Keeps the destination pixels that are not covered by source pixels.
zh_cn: 保留未被源像素覆盖的目标像素。

source: Keeps the destination pixels that cover source pixels, discards the remaining source and destination pixels.
zh_cn: 保留被源像素覆盖的目标像素，丢弃剩余的源像素和目标像素。

source: Keeps the source pixels that cover the destination pixels, discards the remaining source and destination pixels.
zh_cn: 保留覆盖目标像素的源像素，丢弃剩余的源像素和目标像素。

source: Keeps the source pixels that do not cover destination pixels.
zh_cn: 保留未覆盖目标像素的源像素。

source: Known Direct Subclasses
zh_cn: 已知直接子类

source: Known Indirect Subclasses
zh_cn: 已知的间接子类

source: Known direct subclasses
zh_cn: 已知的直接子类

source: Known indirect subclasses
zh_cn: 已知的间接子类

source: Label your input fields using the android:contentDescription attribute
zh_cn: 使用 android:contentDescription 属性标记输入字段

source: Last, it describes some common start-time issues, and gives some hints on how to address them.
zh_cn: 最后，它描述了一些常见的启动时间问题，并提供了一些如何解决它们的提示。

source: Launch performance can suffer when your code overrides the Application object, and executes heavy work or complex logic when initializing that object.
zh_cn: 当代码覆盖 Application 对象并在初始化该对象时执行繁重的工作或复杂的逻辑时，启动性能会受到影响。

source: Launch the process.
zh_cn: 启动进程。

source: Launching the main thread.
zh_cn: 启动主线程。

source: Laying out the screen.
zh_cn: 布局屏幕。

source: Layout
zh_cn: 布局

source: Layout container for a view hierarchy that can be scrolled by the user, allowing it to be larger than the physical display.
zh_cn: view 层次结构的布局容器，可由用户滚动，允许它大于物理显示。

source: Layout information associated with each of the children of a GridLayout.
zh_cn: 与 GridLayout 的每个子项关联的布局信息。

source: Layout information for child views of Toolbars.
zh_cn: 工具栏子 view 的布局信息。

source: Layout is a two pass process: a measure pass and a layout pass.
zh_cn: 布局包括两个过程，测量和布局。

source: Layout manager that allows the user to flip left and right through pages of data.
zh_cn: 布局管理器，允许用户左右翻页数据。

source: Layout parameters that should be supplied for views added to a ViewPager.
zh_cn: 应为添加到 ViewPager 的 view 提供的布局参数。

source: Layout which wraps a TextInputEditText, EditText, or descendant to show a floating label when the hint is hidden while the user inputs text.
zh_cn: 包含 TextInputEditText，EditText 或后代的布局，以便当用户输入文字而隐藏提示时显示浮动标签。

source: LayoutManagers will be forced to fully rebind and relayout all visible views.
zh_cn: LayoutManager 将被迫完全重新绑定和重新布局所有可见 view。

source: LayoutParams are used by views to tell their parents how they want to be laid out.
zh_cn: view 使用 LayoutParams 告诉他们的父母他们想要如何布局。

source: LayoutParams used by StaggeredGridLayoutManager.
zh_cn: StaggeredGridLayoutManager 使用的 LayouParams。

source: Libraries that you add to your code may include unused resources.
zh_cn: 添加到代码中的库可能包含未使用的资源。

source: Like LinearLayout, SlidingPaneLayout supports the use of the layout parameter layout_weight on child views to determine how to divide leftover space after measurement is complete.
zh_cn: 与 LinearLayout 类似，SlidingPaneLayout 支持在子 view 上使用布局参数 layout_weight 来确定在测量完成后如何划分剩余空间。

source: Like AnalogClock, but digital.
zh_cn: 像 AnalogClock，但是数字的。

source: Like all setters on ImageDecoder, this must be called inside onHeaderDecoded.
zh_cn: 与 ImageDecoder 上的所有 setter 一样，必须在 onHeaderDecoded 中调用它。

source: Like many other UI frameworks, Android supports an input event model.
zh_cn: 与许多其他 UI 框架一样，Android 支持输入事件模型。

source: Likewise, when on a lower density screen, the number of pixels used for 1dp is scaled down.
zh_cn: 同样，当在较低密度屏幕上时，用于 1dp 的像素数按比例缩小。

source: Likewise, you need to request a new layout if a property changes that might affect the size or shape of the view.
zh_cn: 同样，如果属性更改可能会影响 view 的大小或形状，则需要请求新布局。

source: Limit Line Length
zh_cn: 限制代码行长度

source: Limit Variable Scope
zh_cn: 限制变量的作用域

source: Line lengths up to 80 or 100 characters are perfectly acceptable, while lengths longer than about 130 or 160 characters (including the length of the tag) should be avoided if possible.
zh_cn: 一行长度在 80 到 100 个字符内是完全可以接受的，应当尽可能避免长度超过 130 或 160 个字符(包括标记的长度)。

source: List diffing with DiffUtil
zh_cn: 使用 DiffUtil 列出差异

source: List mutation with SortedList
zh_cn: 使用 SortedList 列出变异

source: List selector to use for spinnerMode="dropdown" display.
zh_cn: 用于 spinnerMode="dropdown" 显示的列表选择器。

source: ListView attempts to reuse view objects in order to improve performance and avoid a lag in response to user scrolls.
zh_cn: ListView 尝试重用 view 对象以提高性能并避免响应用户滚动的延迟。

source: Listener for applying window insets on a view in a custom way.
zh_cn: 监听器以自定义方式在 view 上应用窗口内缩。

source: Listener for handling events on navigation items.
zh_cn: 用于处理导航项目事件的监听器。

source: Listener for handling reselection events on bottom navigation items.
zh_cn: 用于处理底部导航项目上的重选事件的监听器。

source: Listener for handling selection events on bottom navigation items.
zh_cn: 用于处理底部导航项目上的选择事件的监听器。

source: Listener for monitoring events about drawers.
zh_cn: 用于监控抽屉事件的监听器。

source: Listener for monitoring events about sliding panes.
zh_cn: 监听器用于监视有关滑动窗格的事件。

source: Listener for receiving events when action bar menus are shown or hidden.
zh_cn: 监听器，用于在显示或隐藏操作栏菜单时接收事件。

source: Listener for virtual keyboard events.
zh_cn: 监听虚拟键盘事件。

source: Listener to respond to the AutoCompleteTextView's completion list being dismissed.
zh_cn: 监听器响应 AutoCompleteTextView 的补全列表取消。

source: Live region mode specifying that accessibility services should announce changes to this view.
zh_cn: 实时区域模式，指定可访问性服务应宣布对此 view 的更改。

source: Live region mode specifying that accessibility services should interrupt ongoing speech to immediately announce changes to this view.
zh_cn: 实时区域模式指定可访问性服务应该中断正在进行的语音，以立即宣布对此 view 的更改。

source: Live region mode specifying that accessibility services should not automatically announce changes to this view.
zh_cn: 实时区域模式，指定可访问性服务不应自动声明对此 view 的更改。

source: Load a constraint set from a constraintSet.xml file
zh_cn: 从 constraintSet.xml 文件中加载一个约束集。

source: Loading and decoding bitmaps.
zh_cn: 加载和解码位图。

source: Loading and launching the app.
zh_cn: 加载并启动应用程序。

source: Local variables should be declared at the point they are first used.
zh_cn: 局部变量应该在首次使用时声明。

source: Log Sparingly
zh_cn: 谨慎使用日志记录

source: Logging that reports successes should never be used at levels higher than VERBOSE.
zh_cn: 绝不能使用高于 VERBOSE 级别的日志记录报告成功事件。

source: Long pressing on the lesser and greater values also allows for a quick change of the current value.
zh_cn: 长按较小和较大的值也可以快速更改当前值。

source: Long pressing the buttons allows for a quick change of the current value.
zh_cn: 长按按钮可以快速更改当前值。

source: Look for a descendant to call requestFocus() on.
zh_cn: 询找一个后代来调用 requestFocus() 。

source: Look in our attached views first
zh_cn: 首先看我们的附加 view

source: Loop variables should be declared in the for statement itself unless there is a compelling reason to do otherwise:
zh_cn: 循环变量应该在 for 语句本身中进行声明，除非有令人信服的理由不这么做：

source: Losses of network connectivity are considered common, fully expected, and should not be logged gratuitously.
zh_cn: 失去网络连接属于完全在预期之内的常见情况，没必要记录下来。

source: Lossless encoding is only available if your minSdkVersion is set to 18 or higher.
zh_cn: 无损编码仅在 minSdkVersion 设置为 18 或更高时可用。

source: Lossy WebP images are supported in Android 4.0 (API level 14) and higher, and lossless and transparent WebP images are supported in Android 4.3 (API level 18) and higher.
zh_cn: Android 4.0(API 级别 14)及更高级别支持有损 WebP 图像，Android 4.3(API 级别 18)及更高版本支持无损且透明的 WebP 图像。

source: MATCH_PARENT, which means the view wants to be as big as its parent (minus padding)
zh_cn: MATCH_PARENT，意味着 view 想要和它的父 view 一样大(减去 padding)。

source: Maintain multiple lean APKs
zh_cn: 保持多个精简 APK

source: Make Your Transitions Smooth
zh_cn: 让你的过渡平滑

source: Make it show the pressed state now (before scheduling the click) to ensure the user sees it.
zh_cn: 现在让它显示按下状态(在调度点击之前)，以确保用户看到它。

source: Make sure to understand the footprint of any code which is automatically generated.
zh_cn: 确保了解自动生成的任何代码的占用空间。

source: Make your view hierarchies as shallow as possible.
zh_cn: 使你的 view 层次结构尽可能浅。

source: Makes it obvious what classes are actually used and the code is more readable for maintainers.
zh_cn: 明确指出实际使用了哪些类，而且代码对于维护者来说更易读。

source: Makes the content of a tab when it is selected.
zh_cn: 选中时，制作选项卡的内容。

source: Making the View Interactive
zh_cn: 使 view 交互

source: Manages a surface, which is a special piece of memory that can be composited into the Android view system.
zh_cn: 管理 surface，这是一个特殊的内存块，可以合成到 Android view 系统中。

source: Manages an EGL display, which enables OpenGL to render into a surface.
zh_cn: 管理 EGL 显示，使 OpenGL 能够渲染到 surface。

source: Manually
zh_cn: 手动

source: Manually render this view (and all of its children) to the given Canvas.
zh_cn: 手动渲染该 view(及它所有的子 view)到给定的画布上。

source: Many times you don't need to catch the exception at this level anyway, just let the method throw it.
zh_cn: 很多时候，你无需在该级别捕获异常，只需让相应方法抛出异常即可。

source: Margins in chains
zh_cn: 链中的 margin

source: Margins when connected to a GONE widget
zh_cn: 连接到 GONE 小部件时的边距

source: Mark an attached view as scrap.
zh_cn: 将附加的 view 标记为 scrap (废弃0。

source: MaterialButton manages its own background drawable, and setting a new background means MaterialButton can no longer guarantee that the new attributes it introduces will function properly.
zh_cn: MaterialButton 管理自己的背景 drawable，设置新的背景意味着 MaterialButton 不再能保证它引入的新属性能够正常运行。

source: MaterialButtonToggleGroup also overrides any shapeAppearance, shapeAppearanceOverlay, or cornerRadius attribute set on MaterialButton children such that only the left-most corners of the first child and the right-most corners of the last child retain their shape appearance or corner size.
zh_cn: MaterialButtonToggleGroup 还重写在 MaterialButton 子项上设置的任何 shapeAppearance，shapeAppearanceOverlay 或 cornerRadius 属性，这样只有第一个子项的最左边角落和最后一个子项的最右角保留其形状外观或角落大小。

source: MaterialButtonToggleGroup is a RelativeLayout, and positions children to be aligned to the end of the previous child in the order they are added.
zh_cn: MaterialButtonToggleGroup 是 RelativeLayout，并将子项按照添加顺序对齐到上一个子项的末尾。

source: May be a boolean value, such as "true" or "false".
zh_cn: 可以是布尔值，例如“true”或“false”。

source: May be a color value, in the form of "#rgb", "#argb", "#rrggbb", or "#aarrggbb".
zh_cn: 可以是颜色值，格式为“#rgb”，“#argb”，“#rrggbb“或”#aarrggbb“。

source: May be a reference to another resource, in the form "@[+][package:]type/name" or a theme attribute in the form "?[package:]type/name".
zh_cn: 可能是对另一个资源的引用，格式为 "@[+][package:]type/name" 或格式为 "?[package:]type/name" 的主题属性。

source: May be an integer value, such as "100".
zh_cn: 可以是整数值，例如“100”。

source: Maybe a descendant is what will handle the click.
zh_cn: 也许一个后代会处理这个点击。
